// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VerStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell ver command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_VER_SHELL_VER              #language eng  "EFI Shell Version %d.%d\n"

#string STR_VER_SPEC_REVISION          #language eng  "EFI Specification Revision : %d.%d\n"

#string STR_VER_EFI_VENDOR             #language eng  "EFI Vendor                 : %s\n"

#string STR_VER_EFI_REVISION           #language eng  "EFI Revision               : %d.%d\n"

#string STR_VER_EFI_BUILD_REVISION     #language eng  "EFI Build Version          : %s\n"

#string STR_VER_SHELL_BUILD_REVISION   #language eng  "SHELL Build Version        : %s\n"

#string STR_VER_SHELL_MACHINE_TYPE     #language eng  "EFI Shell Machine Type: %s\n"

#string STR_VER_LINE_HELP              #language eng  "Displays EFI Firmware version information"

#string STR_VER_SHELL_SIG              #language eng  "EFI Shell Signature: %g\n"

#string STR_VER_VERBOSE_HELP           #language eng  "Displays EFI Firmware version information.\n"
                                                      "\n"
                                                      "VER [-s]\n"
                                                      "\n"
                                                      "     -s      - Display EFI Shell version information only\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display EFI Firmware version information:\n"
                                                      "    fs0:\\> ver\n"
                                                      "    EFI Specification Revision : 1.10\n"
                                                      "    EFI Vendor                 : INTEL\n"
                                                      "    EFI Revision               : 14.5\n"
                                                      "\n"
                                                      "  * To display EFI Shell version information only:\n"
                                                      "    Shell> ver -s\n"
                                                      "    EFI Shell Version 1.0\n"
                                                      "    EFI Shell Machine Type: IA32\n"
                                                      "    EFI Shell Signature: D2C18636-40E5-4EB5-A31B-3695FD42C87\n"
